
{
	"name": "Core freakouts",
	"kind": "freakout",
	"list" : [
		"<h1>Don't<br/>Panic</h1><h4>EVERYBODY is freaking out about this stuff (don't you read the news?). Hang in there. <br/>(Before you know it, you'll understand this stuff as well as most of us do)</h4>",
		"<h1>Don't<br/>Panic</h1><h4>Insert pithy yet amazingly perceptive and relevant <a href='https://douglasadams.com/' target='_blank'>Douglas Adams</a> joke here</h4>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>I love deadlines. I like the whooshing sound they make as they fly by.</a></h1>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>This must be Thursday. I never could get the hang of Thursdays.</a></h1>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>Flying is learning how to throw yourself at the ground and miss.</a></h1>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>A learning experience is one of those things that says, 'You know that thing you just did? Don't do that'.</a></h1>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>Would it save [...] a lot of time if I just gave up and went mad now?</a></h1>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>Reality is frequently inaccurate</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>He attacked everything in life with a mix of extraordinary genius and naive incompetence, and it was often difficult to tell which was which.</a></h4>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>Don't you understand that we need to be childish in order to understand? Only a child sees things with perfect clarity, because it hasn't developed all those filters which prevent us from seeing things that we don't expect to see?</a></h1>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>We are stuck with technology when what we really want is just stuff that works</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>There's an infinite number of monkeys outside who want to talk to us about this script for Hamlet they've worked out..</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>The impossible often has a kind of integrity to it which the merely improbable lacks.</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>They are a dreamer, a thinker, a speculative philosopher... or, as their spouse would have it, an idiot.</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>Exactly! [...] So once you do know what the question actually is, you'll know what the answer means.</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>See first, think later, then test. But always see first. Otherwise you will only see what you were expecting. Most scientists forget that.</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>we’ll be saying a big hello to all intelligent life forms everywhere ... and to everyone else out there, the secret is to bang the rocks together, guys.</a></h4>",
		"<h1><a href='https://douglasadams.com/' target='_blank'>Ow! My brains!</a></h1>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>Let the past hold on to itself and let the present move forward into the future.</a></h4>",
		"<h1>Don't<br/>Panic</h1><h4><a href='https://douglasadams.com/' target='_blank'>The major difference between a thing that might go wrong and a thing that cannot possibly go wrong is that when a thing that cannot possibly go wrong goes wrong it usually turns out to be impossible to get at or repair.</a></h4>"
	]
}
